log/128k/128k.out
seqwrites128k: (g=0): rw=write, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
seqread128k: (g=1): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randwrite128k: (g=2): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randread128k: (g=3): rw=randread, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randrw128k: (g=4): rw=randread, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
fio-2.1.11
Starting 5 threads
seqwrites128k: Laying out IO file(s) (1 file(s) / 2048MB)
seqread128k: Laying out IO file(s) (1 file(s) / 2048MB)
randwrite128k: Laying out IO file(s) (1 file(s) / 2048MB)
randread128k: Laying out IO file(s) (1 file(s) / 2048MB)
randrw128k: Laying out IO file(s) (1 file(s) / 2048MB)

seqwrites128k: (groupid=0, jobs=1): err= 0: pid=10381: Tue May 16 13:08:43 2017
  write: io=2048.0MB, bw=103655KB/s, iops=809, runt= 20232msec
    slat (usec): min=12, max=87239, avg=45.84, stdev=986.97
    clat (msec): min=4, max=636, avg=78.97, stdev=46.50
     lat (msec): min=4, max=636, avg=79.02, stdev=46.49
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   21], 10.00th=[   28], 20.00th=[   40],
     | 30.00th=[   50], 40.00th=[   59], 50.00th=[   69], 60.00th=[   81],
     | 70.00th=[   96], 80.00th=[  119], 90.00th=[  145], 95.00th=[  167],
     | 99.00th=[  210], 99.50th=[  231], 99.90th=[  293], 99.95th=[  297],
     | 99.99th=[  404]
    bw (KB  /s): min=84566, max=113721, per=100.00%, avg=103731.53, stdev=5437.51
    lat (msec) : 10=0.48%, 20=3.99%, 50=26.62%, 100=40.92%, 250=27.67%
    lat (msec) : 500=0.31%, 750=0.01%
  cpu          : usr=1.30%, sys=2.16%, ctx=8225, majf=0, minf=384
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=16384/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
seqread128k: (groupid=1, jobs=1): err= 0: pid=10382: Tue May 16 13:08:43 2017
  read : io=2048.0MB, bw=202682KB/s, iops=1583, runt= 10347msec
    slat (usec): min=13, max=247, avg=32.65, stdev= 7.99
    clat (msec): min=1, max=199, avg=40.36, stdev=22.67
     lat (msec): min=1, max=199, avg=40.40, stdev=22.67
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   13], 10.00th=[   18], 20.00th=[   23],
     | 30.00th=[   29], 40.00th=[   34], 50.00th=[   39], 60.00th=[   43],
     | 70.00th=[   48], 80.00th=[   53], 90.00th=[   61], 95.00th=[   75],
     | 99.00th=[  139], 99.50th=[  151], 99.90th=[  178], 99.95th=[  186],
     | 99.99th=[  192]
    bw (KB  /s): min=133120, max=228608, per=100.00%, avg=203088.45, stdev=25620.08
    lat (msec) : 2=0.03%, 4=0.18%, 10=2.18%, 20=11.99%, 50=59.75%
    lat (msec) : 100=23.18%, 250=2.69%
  cpu          : usr=0.97%, sys=8.16%, ctx=15318, majf=0, minf=2342
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randwrite128k: (groupid=2, jobs=1): err= 0: pid=10383: Tue May 16 13:08:43 2017
  write: io=2048.0MB, bw=85921KB/s, iops=671, runt= 24408msec
    slat (usec): min=12, max=56784, avg=40.59, stdev=646.21
    clat (msec): min=3, max=576, avg=95.29, stdev=53.90
     lat (msec): min=3, max=576, avg=95.33, stdev=53.89
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   26], 10.00th=[   36], 20.00th=[   53],
     | 30.00th=[   66], 40.00th=[   77], 50.00th=[   86], 60.00th=[   98],
     | 70.00th=[  113], 80.00th=[  131], 90.00th=[  161], 95.00th=[  194],
     | 99.00th=[  285], 99.50th=[  314], 99.90th=[  392], 99.95th=[  412],
     | 99.99th=[  486]
    bw (KB  /s): min=67394, max=113721, per=100.00%, avg=85942.60, stdev=11517.05
    lat (msec) : 4=0.01%, 10=0.35%, 20=2.58%, 50=15.22%, 100=43.57%
    lat (msec) : 250=36.64%, 500=1.62%, 750=0.01%
  cpu          : usr=0.95%, sys=1.77%, ctx=5358, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=16384/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randread128k: (groupid=3, jobs=1): err= 0: pid=10384: Tue May 16 13:08:43 2017
  read : io=2048.0MB, bw=208175KB/s, iops=1626, runt= 10074msec
    slat (usec): min=17, max=1086, avg=32.23, stdev=11.52
    clat (msec): min=2, max=236, avg=39.31, stdev=22.96
     lat (msec): min=2, max=236, avg=39.34, stdev=22.96
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   12], 10.00th=[   16], 20.00th=[   22],
     | 30.00th=[   27], 40.00th=[   32], 50.00th=[   37], 60.00th=[   42],
     | 70.00th=[   47], 80.00th=[   53], 90.00th=[   61], 95.00th=[   73],
     | 99.00th=[  143], 99.50th=[  169], 99.90th=[  192], 99.95th=[  198],
     | 99.99th=[  206]
    bw (KB  /s): min=110832, max=228608, per=100.00%, avg=208497.15, stdev=28206.95
    lat (msec) : 4=0.11%, 10=3.00%, 20=13.68%, 50=58.85%, 100=22.19%
    lat (msec) : 250=2.16%
  cpu          : usr=1.55%, sys=7.98%, ctx=15351, majf=0, minf=33
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randrw128k: (groupid=4, jobs=1): err= 0: pid=10385: Tue May 16 13:08:43 2017
  read : io=2048.0MB, bw=213821KB/s, iops=1670, runt=  9808msec
    slat (usec): min=19, max=263, avg=33.33, stdev= 6.62
    clat (msec): min=1, max=198, avg=38.27, stdev=20.06
     lat (msec): min=1, max=198, avg=38.30, stdev=20.06
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   13], 10.00th=[   17], 20.00th=[   22],
     | 30.00th=[   27], 40.00th=[   32], 50.00th=[   37], 60.00th=[   42],
     | 70.00th=[   47], 80.00th=[   52], 90.00th=[   60], 95.00th=[   70],
     | 99.00th=[  114], 99.50th=[  129], 99.90th=[  161], 99.95th=[  174],
     | 99.99th=[  196]
    bw (KB  /s): min=159744, max=228608, per=99.96%, avg=213735.95, stdev=21876.97
    lat (msec) : 2=0.02%, 4=0.17%, 10=2.08%, 20=14.59%, 50=60.08%
    lat (msec) : 100=21.44%, 250=1.62%
  cpu          : usr=1.55%, sys=8.65%, ctx=15942, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: io=2048.0MB, aggrb=103655KB/s, minb=103655KB/s, maxb=103655KB/s, mint=20232msec, maxt=20232msec

Run status group 1 (all jobs):
   READ: io=2048.0MB, aggrb=202682KB/s, minb=202682KB/s, maxb=202682KB/s, mint=10347msec, maxt=10347msec

Run status group 2 (all jobs):
  WRITE: io=2048.0MB, aggrb=85920KB/s, minb=85920KB/s, maxb=85920KB/s, mint=24408msec, maxt=24408msec

Run status group 3 (all jobs):
   READ: io=2048.0MB, aggrb=208174KB/s, minb=208174KB/s, maxb=208174KB/s, mint=10074msec, maxt=10074msec

Run status group 4 (all jobs):
   READ: io=2048.0MB, aggrb=213820KB/s, minb=213820KB/s, maxb=213820KB/s, mint=9808msec, maxt=9808msec

Disk stats (read/write):
  sdb: ios=48912/32603, merge=78/221, ticks=1915416/2990572, in_queue=4907340, util=98.27%